"__title__" = "Bank Account (DE)";

"__description__" = "German Bank Account information.";

"bankName" = "Bank Name";

"owner" = "Name on Account";

"accountType" = "סוג";

"bankNo" = "Bank Number (BLZ)";

"accountNo" = "Account Number";

"swift" = "SWIFT Code";

"iban" = "IBAN Number";

"branchInfo" = "Branch Information";

"branchPhone" = "טלפון";

"branchAddress" = "Address";

"telephonePin" = "Telephone PIN";


"menu.accountType.checking" = "Checking";

"menu.accountType.savings" = "Savings";

"menu.accountType.loc" = "Line of Credit";

"menu.accountType.money_market" = "Money Market";

"menu.accountType.other" = "אחר";
